src/InformationRegisters/ДействующиеРасписания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ДействующиеРасписания</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Расписание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Расписания</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Вид меню / Код СУП товара / Специфика</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КаталогиТоваров</v8:Type>
						<v8:Type>cfg:CatalogRef.Специфики</v8:Type>
						<v8:Type>cfg:CatalogRef.Товары</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИнформационнаяБазаГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыИнформационныхБаз</v8:Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеБазы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/СоставГруппИнформационныхБаз.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>СоставГруппИнформационныхБаз</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыИнформационныхБаз</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИнформационнаяБаза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеБазы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ВариантыНаличияВПродаже.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВариантыНаличияВПродаже</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Простой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сложный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПростойПоИБ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СложныйПоИБ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/Товары.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Товары</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.КаталогиТоваров</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодСУП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаПечати</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПечати</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьКоличества</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапросКоличества</Name>
					<Comment>при подборе в заказ</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтдельнойСтрокой</Name>
					<Comment>при упаковке заказа не сворачивать</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантНаличияВПродаже</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыНаличияВПродаже</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьВПродаже</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КогдаВПродаже</Name>
					<Comment>по дням недели</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КогдаВПродажеВремя1</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КогдаВПродажеВремя2</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантПечати</Name>
					<Comment>что печатать на чеке и счете</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выход</Name>
					<Comment>только для печати</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изображение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХранилищеДополнительнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопИнформация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэфПересчета</Name>
					<Comment>в номенклатуру</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаСпецифик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Специфики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинУдельныйВес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксУдельныйВес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Comment>для установки произвольного порядка элементов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Скидка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Скидки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бонусы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Скидки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Тарифы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоммутироемоеУстройство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КоммутируемыеУстройства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разделитель</Name>
					<Comment>разделитель в заказе (тарелка, упаковка)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяПриготовления</Name>
					<Comment>в минутах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоГруппаЕдиниц</Name>
					<Comment>Внутри группы располагаются разные единицы одного и того же наименования</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаКонтроляПродажи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыКонтроляПродажи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>фАлкоголь</Name>
					<Comment>1-алкоголь, 2- алкогольное пиво</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъемБутылки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляМарки</Name>
					<Comment>короткое наименования для отображения в марке повара</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PLU</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КогдаВПродажеПоНеделям</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИнформационнаяБаза</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИнформационныеБазы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПонедельника</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КогдаВПродажеПоИБ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИнформационнаяБаза</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИнформационныеБазы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕстьВПродаже</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КогдаВПродаже</Name>
							<Comment>по дням недели</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КогдаВПродажеВремя1</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КогдаВПродажеВремя2</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/Расписания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Расписания</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПоДнямНедели</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПериодыАктивности</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВремяНач</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяКон</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДеньНедели</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ДниНедели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДниНедели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДеньНедели</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ДниНедели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Действует</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/ДействующиеРасписания/Ext/ManagerModule.bsl
Процедура ВыполнитьОбновлениеПризнакаНаличия(ИмяСправочника, ФлагОшибки, Сообщать = Ложь) Экспорт
	ТекстЗапроса = ("ВЫБРАТЬ
	|	Товары.Ссылка КАК Ссылка,
	|	Товары.ЕстьВПродаже КАК ЕстьВПродаже,
	|	Товары.ЭтоГруппа КАК ЭтоГруппа,
	|	ДействующиеРасписанияСрезПоследних.Расписание КАК Расписание
	|ИЗ
	|	Справочник.Товары КАК Товары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДействующиеРасписания.СрезПоследних(&ТекДата
	|		//, 
	|		//ИнформационнаяБазаГруппа В (&МассивГруппИБиИБ)
	|		) КАК ДействующиеРасписанияСрезПоследних
	|		ПО Товары.Ссылка = ДействующиеРасписанияСрезПоследних.Объект
	|ГДЕ
	|	НЕ Товары.ПометкаУдаления
	|	И Товары.ВариантНаличияВПродаже <> &Простой");
	Если Не Метаданные.Справочники[ИмяСправочника].Иерархический Или Метаданные.Справочники[ИмяСправочника].ИспользованиеПодчинения = Метаданные.СвойстваОбъектов.ИспользованиеПодчинения.Элементам Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Товары.ЭтоГруппа", "Ложь")
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Товары", ИмяСправочника);
	Запрос = Новый Запрос(ТекстЗапроса);
	//Запрос.УстановитьПараметр("МассивГруппИБиИБ", РегистрыСведений.СоставГруппИнформационныхБаз.МассивГруппИБиИБ(ПараметрыСеанса.ТекущаяИБ));
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДатаНаСервере());
	Запрос.УстановитьПараметр("Простой", Перечисления.ВариантыНаличияВПродаже.Простой);
	
	
	
	Рез = Запрос.Выполнить();
	КоличествоПозиций = Рез.Выгрузить().Количество();
	Выборка = Рез.Выбрать();
	Инд = 0;
	Пока Выборка.Следующий() Цикл
		
		Инд=Инд+1;
		Если Сообщать Тогда
			Структура = Новый Структура("Заголовок, Прогресс", ИмяСправочника, Инд/КоличествоПозиций*100);
			Сообщить(ЗначениеВСтрокуВнутр(Структура));
		КонецЕсли;
		ТекущееНаличиеВПродаже = ОпределитьНаличиеВпродаже(Выборка.Ссылка);
		Если Выборка.ЕстьВПродаже = ТекущееНаличиеВПродаже Или Выборка.ЭтоГруппа Тогда
			Продолжить;
		КонецЕсли;
		
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СпрОбъект.ЕстьВПродаже = ТекущееНаличиеВПродаже;
		Попытка
			СпрОбъект.ОбменДанными.Загрузка = Истина;
			СпрОбъект.Записать();
		Исключение
			Сообщить(ОписаниеОшибки());
			ФлагОшибки = Истина;
		КонецПопытки;
				
	КонецЦикла;
	
КонецПроцедуры

// Проставляет ЕстьВПродаже в соответствии с текущим моментом времени
// Принудительно из Режима администратора или в интерфейсе администратора.
Процедура ОбновлениеПризнакаНаличияВПродаже(Сообщать = Ложь) Экспорт
	ФлагОшибки = Ложь;
	ВыполнитьОбновлениеПризнакаНаличия("Товары", ФлагОшибки, Сообщать);
	ВыполнитьОбновлениеПризнакаНаличия("Специфики", ФлагОшибки, Сообщать);	
	Если НЕ ФлагОшибки Тогда
		Константы.ДатаОбновленияПризнакаНаличияВПродаже.Установить(ТекущаяДата());
	КонецЕсли;
КонецПроцедуры


// ОпределитьНаличиеВпродаже
//
// Параметры:
//	Объект  - Строка,СправочникСсылка.Специфики,СправочникСсылка.КаталогиТоваров - объект, для которого определяется наличие в продаже
// 
// Возвращаемое значение:
//   Булево - объект доступен
//
Функция ОпределитьНаличиеВпродаже(пОбъект) Экспорт
	Если ТипЗнч(пОбъект) = Тип("СправочникСсылка.Товары") Тогда
		Объект = пОбъект;
	Иначе
		Объект = пОбъект;
	КонецЕсли;
	//:пОбъект = Справочники.Товары.ПустаяСсылка();
	
	
	//1. Проверяем расписание по ИБ
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ДействующиеРасписанияСрезПоследних.Расписание КАК Расписание
	|ИЗ
	|	РегистрСведений.ДействующиеРасписания.СрезПоследних(
	|			&ТекДата,
	|			Объект = &Объект
	|				И ИнформационнаяБазаГруппа = &ИБ) КАК ДействующиеРасписанияСрезПоследних");

	Запрос.УстановитьПараметр("ТекДата", ТекущаяДатаНаСервере());
	Запрос.УстановитьПараметр("Объект", Объект);
	Запрос.УстановитьПараметр("ИБ", ПараметрыСеанса.ТекущаяИБ);
	РЗ = Запрос.Выполнить();
	Если РЗ.Пустой() Тогда
		// нет расписания для текущей ИБ. Ищем по группам ИБ
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	ДействующиеРасписанияСрезПоследних.Расписание КАК Расписание
		|ИЗ
		|	РегистрСведений.ДействующиеРасписания.СрезПоследних(&ТекДата, Объект = &Объект) КАК ДействующиеРасписанияСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СоставГруппИнформационныхБаз КАК СоставГруппИнформационныхБаз
		|		ПО ДействующиеРасписанияСрезПоследних.ИнформационнаяБазаГруппа = СоставГруппИнформационныхБаз.ИнформационнаяБаза
		|ГДЕ
		|	СоставГруппИнформационныхБаз.ИнформационнаяБаза = &ИБ");
		Запрос.УстановитьПараметр("ТекДата", ТекущаяДатаНаСервере());
		Запрос.УстановитьПараметр("Объект", Объект);
		Запрос.УстановитьПараметр("ИБ", ПараметрыСеанса.ТекущаяИБ);
		РЗ = Запрос.Выполнить();
		Если РЗ.Пустой() Тогда
			// нет расписания для групп ИБ. Ищем по всем ИБ
			Запрос = Новый Запрос("ВЫБРАТЬ
			|	ДействующиеРасписанияСрезПоследних.Расписание КАК Расписание
			|ИЗ
			|	РегистрСведений.ДействующиеРасписания.СрезПоследних(
			|			&ТекДата,
			|			Объект = &Объект
			|				И (ИнформационнаяБазаГруппа = НЕОПРЕДЕЛЕНО
			|					ИЛИ ИнформационнаяБазаГруппа = ЗНАЧЕНИЕ(Справочник.ГруппыИнформационныхБаз.ВсеИБ)
			|					ИЛИ ИнформационнаяБазаГруппа = ЗНАЧЕНИЕ(Справочник.ГруппыИнформационныхБаз.ПустаяСсылка))) КАК ДействующиеРасписанияСрезПоследних");
			Запрос.УстановитьПараметр("ТекДата", ТекущаяДатаНаСервере());
			Запрос.УстановитьПараметр("Объект", Объект);
			РЗ = Запрос.Выполнить();
			Если РЗ.Пустой() Тогда
				// нет расписания - значит объект есть в продаже (?) TODO
				Возврат Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	Расписание = РЗ.Выгрузить()[0][0];
	Возврат РасписаниеДействует(Расписание);
КонецФункции

Функция РасписаниеДействует(Расписание) Экспорт
	Дата = ТекущаяДатаНаСервере();
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	&Расписание КАК Расписание
	|ПОМЕСТИТЬ Расписания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Расписания.Расписание КАК Расписание
	|ИЗ
	|	Расписания КАК Расписания
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Расписания.ДниНедели КАК РасписанияДниНедели
	|		ПО Расписания.Расписание = РасписанияДниНедели.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Расписания.ПериодыАктивности КАК РасписанияПериодыАктивности
	|		ПО (РасписанияПериодыАктивности.Ссылка = Расписания.Расписание)
	|			И (РасписанияПериодыАктивности.ДеньНедели = РасписанияДниНедели.ДеньНедели
	|				ИЛИ РасписанияПериодыАктивности.ДеньНедели = ЗНАЧЕНИЕ(Перечисление.ДниНедели.ПустаяСсылка))
	|ГДЕ
	|	РасписанияДниНедели.ДеньНедели = &ДеньНедели
	|	И РасписанияДниНедели.Действует
	|	И &ТекущееВремя МЕЖДУ РасписанияПериодыАктивности.ВремяНач И РасписанияПериодыАктивности.ВремяКон");

	Запрос.УстановитьПараметр("Расписание", Расписание);
	Запрос.УстановитьПараметр("ДеньНедели", Перечисления.ДниНедели[ДеньНедели(Дата)-1]);	
	Запрос.УстановитьПараметр("ТекущееВремя", ВремяИзДаты(ТекущаяДата()));	
	Возврат Не Запрос.Выполнить().Пустой();

КонецФункции
